
public class SHpora {

/*    +	Сложение	Складывает два числа.Также может объединять строки (конкатенация).	5 + 3 → 8 "при" + "вет" → "привет"
      -	Вычитание	Вычитает одно число из другого.	10 - 4 → 6
      *	Умножение	Умножает два числа.	2 * 7 → 14
      /	Деление	Делит одно число на другое.	20 / 5 → 4.0
      %	Деление по модулю
      ! - Инверсия     !false == True
      &&  Логическое И
      || - Логическое ИЛИ
            */



    /*int a; // Объявление переменной
    int b = 0; // Инициализация переменнной */



//        Scanner scanner = new Scanner(System.in); // сканер позволяет считывать входной поток данных
//        System.out.println("введи знач с клавы");
//        int a = scanner.nextInt(); // nextInt - позволяет запросить ввод значения с клавиатуры так как nextInt ( принимает только инты значение можно менять)
//        System.out.println(a);



//        Random random = new Random(); // создает генирацию рандомных символов ( рандом тип данных)
//        int a = random.nextInt(50); //указываем правую граниу длинны массива создая рандомну длинну
//        System.out.println(a);

    // ctr + insert - создание конструктора
    //пкм -> generate
    //alt = insert -> override methods
    //ctr + p Просмотр подсказок
    //ctr + LKM ПЕРЕХОД кудато



    //Калькулятор
    //тип_данных название переменной = new конструктор_класса
    //Phone iphone = new Phone("Iphone Pro 1234", 1, true); //Phone тип данных
    //System.out.println(iphone.expirationDate); //обращение к функциональности объекта
    //iphone.printIfo();// та функциональность которую мы описали

    //Наследование 7 урок
    //extends - позволяет наследовать класс ( описывается позле названия класса )

    //alt = insert -> override methods

    //this.blocked = blocked; - this.blocked относится к переменной blocked(которая вверху). А  = blocked; относится к переменной в методе
    // void - ничего не возвращает изменяем состояние
    //private - делает поле не видимым за пределами класса. Они не доступны в не класса
    // static - статические методы не пренодлежат не какому экземпляру они пренадлежат классу. Мотод который создает какойт то новый инстанс пример в банк акаунт
    //get Для тех полей которые мы хотим дать читать get еры  создается метот для чтения который начинает называтся getBalance
    //set  Для того что бы изменить что то в private пишется метоот setir set названия setBlocked
    // ПКМ > Generate или alt+iser ставит быстро гетеры и сеторы
    // isBlocked пишем тогда когда значение булеан






    /*Month [] allMonths = new Month [] {
            january, february, march, april, may, june, july, august, september, october, november, december
        };*/

    // Альтернативные констракторы - отрабатывает только один раз, только при его создани


    //Бывает простые типы и референс тайп (Реф это массив и еще другие строка и т.д ) Они пишутся с большой буквы кроме массива
    // "" - выделяются строки
    //'' - выделяются тип char 1 символ  только 1 символ


    // Arrays.toString() работает только с одномерными массивами.
    // Arrays.deepToString() нужен, когда массив содержит другие массивы внутри — то есть, когда это массив массивов.
    // s.substring( 2, 6) -- выписать со строки с со 2 по 6 элемент но 6 не возвращает
    //>> Arrays.toString(arr1) - Вывести массив в строку
    //Arrays.length - Длинна массива
    //.clon - скопировать массив один в один

    //win+ alt + enter - помогает решить кучу проблем
    // ctrl probel подсказка что можно изменить
    //Shift + f6 - Груповое редактирование Переименование
    //Навсети курсор на метот и нажать  ctr+q можно открыть как работает метод


    //   Преоброзование целого числа в строку
   /* String.valueOf()	    String.valueOf(123)
      Конкатенация	        123 + ""
      Integer.toString()	Integer.toString(123)
      String.format()	    String.format("%d", 123)*/



}

